In [1]:
import pandas as pd

In [3]:
df= pd.read_csv('Automobile_data.csv')
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [4]:
df.info

<bound method DataFrame.info of     index      company   body-style  wheel-base  length engine-type  \
0       0  alfa-romero  convertible        88.6   168.8        dohc
1       1  alfa-romero  convertible        88.6   168.8        dohc
2       2  alfa-romero    hatchback        94.5   171.2        ohcv
3       3         audi        sedan        99.8   176.6         ohc
4       4         audi        sedan        99.4   176.6         ohc
..    ...          ...          ...         ...     ...         ...
56     81   volkswagen        sedan        97.3   171.7         ohc
57     82   volkswagen        sedan        97.3   171.7         ohc
58     86   volkswagen        sedan        97.3   171.7         ohc
59     87        volvo        sedan       104.3   188.8         ohc
60     88        volvo        wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
0              four         111               21  13495.0
1              four         111               21  16500.0
2               six         154               19  16500.0
3              four         102               24  13950.0
4              five         115               18  17450.0
..              ...         ...              ...      ...
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

[61 rows x 10 columns]>

In [5]:
df.describe()

,index,wheel-base,length,horsepower,average-mileage,price
count,61.000000,61.000000,61.000000,61.000000,61.000000,58.000000
mean,40.885246,98.481967,173.098361,107.852459,25.803279,15387.000000
std,25.429706,6.679234,14.021846,53.524398,8.129821,11320.259841
min,0.000000,88.400000,141.100000,48.000000,13.000000,5151.000000
25%,18.000000,94.500000,159.100000,68.000000,19.000000,6808.500000
50%,39.000000,96.300000,171.200000,100.000000,25.000000,11095.000000
75%,61.000000,101.200000,177.300000,123.000000,31.000000,18120.500000
max,88.000000,120.900000,208.100000,288.000000,47.000000,45400.000000

In [7]:
df.shape

(61, 10)

In [8]:
df.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [9]:
df.duplicated().sum()

0

In [10]:
df['price']= pd.to_numeric(df['price'], errors='coerce')

In [11]:
df.isnull(). sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [12]:
price_mean= df['price'].mean()
print(f"Price Average: {price_mean}")

Price Average: 15387.0

In [14]:
df.[price]

SyntaxError: invalid syntax (853149366.py, line 1)

In [18]:
pd.set_option('display.max_rows', None)
df['price']

0     13495.0
1     16500.0
2     16500.0
3     13950.0
4     17450.0
5     15250.0
6     18920.0
7     16430.0
8     16925.0
9     20970.0
10    30760.0
11    41315.0
12    36880.0
13     5151.0
14     6295.0
15     6575.0
16     6377.0
17     6229.0
18     7295.0
19    12945.0
20    10345.0
21     6785.0
22        NaN
23        NaN
24    32250.0
25    35550.0
26    36000.0
27     5195.0
28     6095.0
29     6795.0
30    11845.0
31    18344.0
32    25552.0
33    28248.0
34    40960.0
35    45400.0
36     5389.0
37     6189.0
38     6989.0
39     8189.0
40     7099.0
41     6649.0
42     6849.0
43     7349.0
44    13499.0
45    34028.0
46    37028.0
47        NaN
48     5348.0
49     6338.0
50     6488.0
51     6918.0
52     7898.0
53     8778.0
54    15750.0
55     7775.0
56     7975.0
57     7995.0
58     9995.0
59    12940.0
60    13415.0
Name: price, dtype: float64

In [19]:
df['price']= df['price'].fillna(price_mean)

In [20]:
pd.set_option('display.max_rows', None)
df['price']

0     13495.0
1     16500.0
2     16500.0
3     13950.0
4     17450.0
5     15250.0
6     18920.0
7     16430.0
8     16925.0
9     20970.0
10    30760.0
11    41315.0
12    36880.0
13     5151.0
14     6295.0
15     6575.0
16     6377.0
17     6229.0
18     7295.0
19    12945.0
20    10345.0
21     6785.0
22    15387.0
23    15387.0
24    32250.0
25    35550.0
26    36000.0
27     5195.0
28     6095.0
29     6795.0
30    11845.0
31    18344.0
32    25552.0
33    28248.0
34    40960.0
35    45400.0
36     5389.0
37     6189.0
38     6989.0
39     8189.0
40     7099.0
41     6649.0
42     6849.0
43     7349.0
44    13499.0
45    34028.0
46    37028.0
47    15387.0
48     5348.0
49     6338.0
50     6488.0
51     6918.0
52     7898.0
53     8778.0
54    15750.0
55     7775.0
56     7975.0
57     7995.0
58     9995.0
59    12940.0
60    13415.0
Name: price, dtype: float64